// @strict-types

#Область ОписаниеПеременных
&НаКлиенте
Перем ОкрДо10 Экспорт;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	РассчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	РассчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммы()
	
	Сумма = Объект.Количество * Объект.Цена;
	
	Если ОкрДо10 Тогда
		
	КонецЕсли;
	
	Объект.Сумма = Сумма;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
